## Importing  required libraries

In [71]:
import pandas as pd
print('pandas version : ', pd.__version__)

pandas version :  1.1.5

## 1.Creating DataFrames from scratch.

In [72]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}

purchases = pd.DataFrame(data)

In [73]:
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [74]:
purchases = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])
purchases

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

## 2.How to read data from various files

In [75]:
df = pd.read_csv('dataset/purchases.csv')
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [76]:
df = pd.read_csv('dataset/purchases.csv', index_col=0)
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [77]:
df = pd.read_json('dataset/purchases.json')
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

## 3.Writing back to a CSV and JSON

In [78]:
df.to_csv('write_dataset/new_purchases.csv')
df.to_json('write_dataset/new_purchases.json')

In [79]:
csv_df = pd.read_csv('write_dataset/new_purchases.csv', index_col=0)
csv_df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [80]:
json_df = pd.read_json('write_dataset/new_purchases.json')
json_df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

## 4.Renaming dataframe columns and index name

In [81]:
rename_df = json_df.rename({'apples':'APPLE', 'oranges' : 'ORANGE'}, axis=1)
rename_df

        APPLE  ORANGE
June        3       0
Robert      2       3
Lily        0       7
David       1       2

In [82]:
rename_df.index

Index(['June', 'Robert', 'Lily', 'David'], dtype='object')

In [83]:
rename_df.columns

Index(['APPLE', 'ORANGE'], dtype='object')

In [84]:
rename_df.shape

(4, 2)

In [85]:
rename_df.index.names = ['MONTH']

In [86]:
rename_df

        APPLE  ORANGE
MONTH
June        3       0
Robert      2       3
Lily        0       7
David       1       2